# Задание №3
# Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и через dict.
print('============================')
print("Решение через list")
print('============================')
seasons = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
str_i = ''
while str_i != '0':
    str_i = input("Введите месяц в виде целого числа [1-12] (0 - отказаться): ")
    if str_i in ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']:
        print(f"Это {seasons[int(str_i) - 1]}")
print('============================')
print("Решение через dict")
print('============================')
seasons = {'1': "Зима", '2': "Зима", '3': "Весна", '4': "Весна", '5': "Весна", '6': "Лето", '7': "Лето", '8': "Лето", '9': "Осень", '10': "Осень", '11': "Осень", '12': "Зима"}
str_i = ''
while str_i != '0':
    str_i = input("Введите месяц в виде целого числа [1-12] (0 - отказаться): ")
    if str_i in ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']:
        print(f"Это {seasons.get(str_i)}")
